Let's Start Day 2 of Learning PANDAS

Here are some important topics we’ll cover today, along with one question each:

1. Read CSV File  
   ➤ Q1: Load a CSV file named data.csv using pandas.

2. Set Index  
   ➤ Q2: Set the 'ID' column as index from a given DataFrame.

3. Select Multiple Columns  
   ➤ Q3: Select columns 'Name' and 'Age' from a DataFrame.

4. Filtering Rows  
   ➤ Q4: Select rows where 'Age' is greater than 30.

5. Add New Column  
   ➤ Q5: Add a new column 'Score' with values.

6. Update Column Values  
   ➤ Q6: Update all 'Score' values to 100.

7. Drop Column  
   ➤ Q7: Drop the 'Gender' column from the DataFrame.

8. Drop Row  
   ➤ Q8: Drop the row with index 2.

9. Check for Null Values  
   ➤ Q9: Check for missing values in each column.

10. Fill Missing Values  
   ➤ Q10: Fill missing values in 'Age' column with 0.

In [2]:
# ➤ Q1: Load a CSV file named data.csv using pandas.

import pandas as pd

df = pd.read_csv("Train.csv")

print(df)

   TrainNo.  Speed        From       To
0    615116     36     Kolkata   Mumbai
1    516135     89       Delhi  Chennai
2    565156     54    Allahbad  Gujarat
3    615126     63  Tamil Nadu   Odisha
4    528896     72         U.P   Punjab

In [17]:
# Set Index
# ➤ Q2: Set the 'ID' column as index from a given DataFrame.

import numpy as np

df = pd.DataFrame(np.random.randint(1, 101, (10, 9)))  # 9 columns of data
df["ID"] = np.arange(1,11)   # Add "ID" column
print(df)

    0   1    2   3   4    5   6   7   8  ID
0  69  72   94   7  18   49  99  70  44   1
1  36  40    2  53  77   21  35  53  73   2
2  74  59  100  75  32   32   4  22  91   3
3  53  90   23  47  20  100  21  32  33   4
4  82  22   11  96  40   54  19  10  26   5
5  44   3   67  42  59   71  75  20  48   6
6  97  17   26  64   6   99  20  36  65   7
7  99  51   24  54  23   99  16  87  51   8
8  31   8   26  44  81   23  48   4  68   9
9   9  72  100  83   6    8  37  83  69  10

In [22]:
# ➤ Q3: Select columns 'Name' and 'Age' from a DataFrame.
df = pd.DataFrame({
    "Name" : ["Atul", "Ramesh", "Soni", "Ajit"],
    "Age" : [54, 26, 42, 22],
    "City" : ["Delhi", "Bangluru", "Gujarat", "Ahamdabad"]
})
df[["Name", "Age"]]

     Name  Age
0    Atul   54
1  Ramesh   26
2    Soni   42
3    Ajit   22

In [29]:
# ➤ Q4: Select rows where 'Age' is greater than 30.

df[df["Age"]>30]

   Name  Age     City
0  Atul   54    Delhi
2  Soni   42  Gujarat

In [33]:
# ➤ Q5: Add a new column 'Score' with values.
df["Score"] = np.random.randint(30,95,len(df))
df

     Name  Age       City  Score
0    Atul   54      Delhi     90
1  Ramesh   26   Bangluru     50
2    Soni   42    Gujarat     55
3    Ajit   22  Ahamdabad     88

In [34]:
# ➤ Q6: Update all 'Score' values to 100.
df["Score"] = 100
df

     Name  Age       City  Score
0    Atul   54      Delhi    100
1  Ramesh   26   Bangluru    100
2    Soni   42    Gujarat    100
3    Ajit   22  Ahamdabad    100

In [68]:
# ➤ Q7: Drop the 'Gender' column from the DataFrame.
new_df = pd.DataFrame({
    "Name" : ["Atul", "Ramesh", "Soni", "Ajit"],
    "Age" : [54, 26, 42, 22],
    "City" : ["Delhi", "Bangluru", "Gujarat", "Ahamdabad"],
    "Gender" : ["Male", "Male" , "Female", "Male"]
})
new_df.drop("Gender", axis = 1, inplace= True)
new_df

     Name  Age       City
0    Atul   54      Delhi
1  Ramesh   26   Bangluru
2    Soni   42    Gujarat
3    Ajit   22  Ahamdabad

In [71]:

# ➤ Q8: Drop the row with index 2.

new_df.drop(2, axis = 0, inplace = True)
new_df

     Name   Age       City
0    Atul  54.0      Delhi
1  Ramesh   NaN   Bangluru
3    Ajit  22.0  Ahamdabad

In [88]:
# ➤ Q9: Check for missing values in each column.
new_df.iloc[1,1] = np.nan
new_df.isnull()

    Name    Age   City
0  False  False  False
1  False   True  False
3  False  False  False

In [91]:
# ➤ Q10: Fill missing values in 'Age' column with 0.
new_df["Age"].fillna(method = 'ffill', inplace = True)
new_df["Age"].fillna(0, inplace= True)
new_df

C:\Users\Prem Kiran Nayak\AppData\Local\Temp\ipykernel_8032\2365881527.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_df["Age"].fillna(method = 'ffill', inplace = True)

     Name   Age       City
0    Atul  54.0      Delhi
1  Ramesh   0.0   Bangluru
3    Ajit  22.0  Ahamdabad

In [16]:
# ➤ Q11: Check the number of rows and columns in the DataFrame you loaded using Train.csv.
df.info()

print("Shape of df : ", df.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   TrainNo.  5 non-null      int64
 1   Speed     5 non-null      int64
 2   From      5 non-null      object
 3   To        5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes
Shape of df :  (5, 4)